app/controllers/notes_controller.rb

  def create
    @note = current_user.notes.build(note_params)
    if @note.save
---
INSERT INTO "notes" ("content", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "test test"], ["created_at", "2016-03-08 02:06:59.638469"], ["title", "note de test"], ["updated_at", "2016-03-08 02:06:59.638469"], ["user_id", 1]]

  def find_note
    @note = Note.find(params[:id])
---
SELECT  "notes".* FROM "notes"  WHERE "notes"."id" = $1 LIMIT 1  [["id", 1]]